src/InformationRegisters/Scan_КомпанииПользователей/Scan_КомпанииПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КомпанииПользователей</name>
  <attributes>
    <name>ПользовательАвтор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ВзаимосвязьКомпанийСКонтрагентами/Scan_ВзаимосвязьКомпанийСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ВзаимосвязьКомпанийСКонтрагентами</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИзмененияВ1БД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимУстановкиВидаВзаимодействия</name>
    <type>
      <types>EnumRef.Scan_РежимУстановкиВидаВзаимодействия</types>
    </type>
  </attributes>
  <dimensions>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВзаимодействия</name>
    <type>
      <types>CatalogRef.Scan_ВидыВзаимодействий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_РежимДоступаПользователяККомпаниям/Scan_РежимДоступаПользователяККомпаниям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_РежимДоступаПользователяККомпаниям</name>
  <enumValues>
    <name>СписокКомпаний</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКомпаний</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_Компании/Scan_Компании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Компании</name>
  <predefined>
    <items>
      <name>СканияРусь</name>
      <description>Скания Русь</description>
    </items>
  </predefined>
  <attributes>
    <name>DealerID_COW</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДилера</name>
    <type>
      <types>EnumRef.Scan_ВидыДилеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_ГруппыКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДилерАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДилера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйСклад</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_СтатусыКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыДилеров</name>
    <type>
      <types>CatalogRef.Scan_ТипыДилеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_ФормыКомпаний</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РегионыОтветственности</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Scan_Регионы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеМаркиДилера</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.Scan_МаркиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_КомпанииПользователей/ManagerModule.bsl
//rarus vikhle 22.04.2020 mt 15695 +++

// Функция возвращает компанию и контрагентов пользователя
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  ТолькоОсновной - Булево - при значении Истина функция вернет только основную связку компания-контрагент, при Ложь - все компании и контрагенты пользователя
//	ДилерАктивен - Булево - при переданном признаке накладывается соответствующее условие по реквизиту "ДилерАктивен" компании  
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица с колонками:
//		* Компания		- СправочникСсылка.Scan_Компании 
//		* Контрагент	- СправочникСсылка.Scan_Контрагенты
//		* Основной		- Булево
//
Функция ПолучитьКомпаниюДилераПользователя (Пользователь, ТолькоОсновной = Ложь) Экспорт
	
	// Для режима доступа Список компаний оставляем прежнюю логику
	Если Пользователь.РежимДоступаККомпаниям = Перечисления.Scan_РежимДоступаПользователяККомпаниям.СписокКомпаний Тогда //rarus kabany Дата: 08/07/2021 17897 ++ 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Scan_КомпанииПользователей.Компания КАК Компания,
		|	Scan_ВзаимосвязьКомпанийСКонтрагентамиСрезПоследних.Контрагент КАК Контрагент,
		|	Scan_КомпанииПользователей.Основной КАК Основной
		|ИЗ
		|	РегистрСведений.Scan_КомпанииПользователей КАК Scan_КомпанииПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ВзаимосвязьКомпанийСКонтрагентами.СрезПоследних(, ВидВзаимодействия = &ВидВзаимодействияДилер) КАК Scan_ВзаимосвязьКомпанийСКонтрагентамиСрезПоследних
		|		ПО Scan_КомпанииПользователей.Компания = Scan_ВзаимосвязьКомпанийСКонтрагентамиСрезПоследних.Компания
		|ГДЕ
		|	Scan_КомпанииПользователей.Пользователь = &Пользователь";
		Если ТолькоОсновной Тогда 
			Запрос.Текст = Запрос.Текст + " И Scan_КомпанииПользователей.Основной = Истина";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидВзаимодействияДилер",Scan_ПраваИНастройки.Scan_Право("ВидВзаимодействияДилер"));
		Запрос.УстановитьПараметр("Пользователь",Пользователь);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		Возврат РезультатЗапроса;
		//rarus kabany Дата: 08/07/2021 17897 ++	
	Иначе
		//rarus kabany Дата: 14/07/2021 17897 ++
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Scan_КомпанииПользователей.Компания.ГруппыКомпаний КАК КомпанияГруппыКомпаний,
		|	Scan_КомпанииПользователей.Компания КАК Компания
		|ПОМЕСТИТЬ ГруппаКомпаний
		|ИЗ
		|	РегистрСведений.Scan_КомпанииПользователей КАК Scan_КомпанииПользователей
		|ГДЕ
		|	Scan_КомпанииПользователей.Пользователь = &Пользователь
		|	И Scan_КомпанииПользователей.Компания.ГруппыКомпаний <> ЗНАЧЕНИЕ(Справочник.Scan_ГруппыКомпаний.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Scan_Компании.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ГруппаКомпаний.Компания = Scan_Компании.Ссылка
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Основной
		|ПОМЕСТИТЬ Компании
		|ИЗ
		|	ГруппаКомпаний КАК ГруппаКомпаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_Компании КАК Scan_Компании
		|		ПО (ГруппаКомпаний.КомпанияГруппыКомпаний = Scan_Компании.ГруппыКомпаний)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Компании.Ссылка КАК Компания,
		|	Scan_ВзаимосвязьКомпанийСКонтрагентамиСрезПоследних.Контрагент КАК Контрагент,
		|	Компании.Основной КАК Основной
		|ИЗ
		|	Компании КАК Компании
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ВзаимосвязьКомпанийСКонтрагентами.СрезПоследних(, ВидВзаимодействия = &ВидВзаимодействияДилер) КАК Scan_ВзаимосвязьКомпанийСКонтрагентамиСрезПоследних
		|		ПО (Компании.Ссылка = Scan_ВзаимосвязьКомпанийСКонтрагентамиСрезПоследних.Компания)
		|УПОРЯДОЧИТЬ ПО
		|	Основной УБЫВ"; // rarus kabany 15.07.2021 17897 ++ // добавлена сортировка 
		//rarus kabany Дата: 14/07/2021 17897 --
		Запрос.УстановитьПараметр("ВидВзаимодействияДилер",Scan_ПраваИНастройки.Scan_Право("ВидВзаимодействияДилер"));
		Запрос.УстановитьПараметр("Пользователь",Пользователь);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		Возврат РезультатЗапроса;
		//rarus kabany Дата: 08/07/2021 17897 --
	КонецЕсли;
КонецФункции

// Процедура записи в регистр сведений
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  ТаблицаКомпаний - ТаблицаЗначений - с колонками:
//  	 * Компания - СправочникСсылка.Scan_Компании
//  	 * Основной - Булево 
Процедура ЗаписьЗначенияРегистраСведений (Пользователь, ТаблицаКомпаний) Экспорт
	НаборЗаписей = РегистрыСведений.Scan_КомпанииПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	Для Каждого СтрокаТаблицы Из ТаблицаКомпаний Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Пользователь = Пользователь;
		НоваяЗапись.Компания =	СтрокаТаблицы.Компания;
		НоваяЗапись.Основной =  СтрокаТаблицы.Основной;
		НоваяЗапись.ПользовательАвтор = Пользователи.АвторизованныйПользователь();
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
//rarus vikhle 22.04.2020 mt 15695 ---
